.. _cups_userguide:

CUPS Strings
============

Introduction
------------

The function :func:`clean_es_cups() <dataprep.clean.clean_es_cups.clean_es_cups>` cleans a column containing Spanish meter point number (CUPS) strings, and standardizes them in a given format. The function :func:`validate_es_cups() <dataprep.clean.clean_es_cups.validate_es_cups>` validates either a single CUPS strings, a column of CUPS strings or a DataFrame of CUPS strings, returning `True` if the value is valid, and `False` otherwise.

CUPS strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "ES1234123456789012JY1F"
* `standard`: CUPS strings with proper whitespace in the proper places, like "ES 1234 1234 5678 9012 JY 1F"

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_es_cups()` and `validate_es_cups()`.

### An example dataset containing CUPS strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "cups": [
            "ES1234123456789012JY1F",
            "ES 1234-123456789012-XY 1F",
            "51824753556",
            "51 824 753 556",
            "hello",
            np.nan,
            "NULL"
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

,cups,address
0,ES1234123456789012JY1F,123 Pine Ave.
1,ES 1234-123456789012-XY 1F,main st
2,51824753556,1234 west main heights 57033
3,51 824 753 556,apt 1 789 s maple rd manhattan
4,hello,"robie house, 789 north main street"
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles"
6,NULL,hello

## 1. Default `clean_es_cups`

By default, `clean_es_cups` will clean cups strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_es_cups
clean_es_cups(df, column = "cups")

,cups,address,cups_clean
0,ES1234123456789012JY1F,123 Pine Ave.,ES 1234 1234 5678 9012 JY 1F
1,ES 1234-123456789012-XY 1F,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_es_cups(df, column = "cups", output_format="standard")

,cups,address,cups_clean
0,ES1234123456789012JY1F,123 Pine Ave.,ES 1234 1234 5678 9012 JY 1F
1,ES 1234-123456789012-XY 1F,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `compact`

In [4]:
clean_es_cups(df, column = "cups", output_format="compact")

,cups,address,cups_clean
0,ES1234123456789012JY1F,123 Pine Ave.,ES1234123456789012JY1F
1,ES 1234-123456789012-XY 1F,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned CUPS strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_es_cups(df, column="cups", inplace=True)

,cups_clean,address
0,ES 1234 1234 5678 9012 JY 1F,123 Pine Ave.
1,NaN,main st
2,NaN,1234 west main heights 57033
3,NaN,apt 1 789 s maple rd manhattan
4,NaN,"robie house, 789 north main street"
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles"
6,NaN,hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_es_cups(df, "cups", errors="coerce")

,cups,address,cups_clean
0,ES1234123456789012JY1F,123 Pine Ave.,ES 1234 1234 5678 9012 JY 1F
1,ES 1234-123456789012-XY 1F,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `ignore`

In [7]:
clean_es_cups(df, "cups", errors="ignore")

,cups,address,cups_clean
0,ES1234123456789012JY1F,123 Pine Ave.,ES 1234 1234 5678 9012 JY 1F
1,ES 1234-123456789012-XY 1F,main st,ES 1234-123456789012-XY 1F
2,51824753556,1234 west main heights 57033,51824753556
3,51 824 753 556,apt 1 789 s maple rd manhattan,51 824 753 556
4,hello,"robie house, 789 north main street",hello
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 4. `validate_es_cups()`

`validate_es_cups()` returns `True` when the input is a valid CUPS. Otherwise it returns `False`.

The input of `validate_es_cups()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_es_cups()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_es_cups()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_es_cups
print(validate_es_cups("ES1234123456789012JY1F"))
print(validate_es_cups("ES 1234-123456789012-XY 1F"))
print(validate_es_cups("51824753556"))
print(validate_es_cups("51 824 753 556"))
print(validate_es_cups("hello"))
print(validate_es_cups(np.nan))
print(validate_es_cups("NULL"))

True
False
False
False
False
False
False

### Series

In [9]:
validate_es_cups(df["cups"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: cups, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_es_cups(df, column="cups")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: cups, dtype: bool

### Only DataFrame

In [11]:
validate_es_cups(df)

    cups  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False